# GuidEnum Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GuidEnum Members
GuidEnum Class Constructors Methods Properties See Also
---
The GuidEnum type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GuidEnum | Creates an Guid-based enum instance with the supplied name and GUID. GUID-based enum instance can be compared by this guid value. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Compares two Guid-based enum object based on their concrete class and GUID value.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Generates a hash code for this Guid-based enum object.  (Overrides Object..::..GetHashCode()()()().) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Guid | The Guid of GUID-based enum object. |

# See Also
GuidEnum Class
Autodesk.Revit.DB Namespace